cascade_test/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
libs ("libforces.so");

functions
{
    forces
    {
        type forces;
        functionObjectLibs ("libforces.so");
        patches (blade);
        rhoName rhoInf;
        rhoInf 1.2; //Reference density for fluid
        CofR (0.05 0 0);
        outputControl outputTime;
        outputInterval 20;
    }
}

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         8000;

deltaT          1;

writeControl    timeStep;

writeInterval   1000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;


// ************************************************************************* //
