cascade_test/constant/polyMesh/blockMeshDict
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	object	blockMeshDict;
}
convertToMeters	1.0;

vertices
(
	(0.0114775856286 -0.00722430607266 0.0)
	(0.0218495856605 0.00153591866559 0.0)
	(0.037241908753 0.00763335993226 0.0)
	(0.0373949070009 0.00723771213922 0.0)
	(0.0233784913802 -0.00101941695621 0.0)
	(0.0117682984223 -0.00758491709795 0.0)
	(-0.00649519052838 -0.00161637104623 0.0)
	(0.0218495856605 0.0126287300227 0.0)
	(0.0374855715851 0.0206508529685 0.0)
	(0.0554855715851 0.0254129717808 0.0)
	(0.0554855715851 0.0135772041091 0.0)
	(0.0554855715851 0.0109470335154 0.0)
	(0.0554855715851 -0.000888734156231 0.0)
	(0.0374855715851 -0.00565085296852 0.0)
	(0.0218495856605 -0.0136729759143 0.0)
	(-0.00649519052838 -0.0279180769833 0.0)
	(0.0114775856286 -0.00722430607266 0.003)
	(0.0218495856605 0.00153591866559 0.003)
	(0.037241908753 0.00763335993226 0.003)
	(0.0373949070009 0.00723771213922 0.003)
	(0.0233784913802 -0.00101941695621 0.003)
	(0.0117682984223 -0.00758491709795 0.003)
	(-0.00649519052838 -0.00161637104623 0.003)
	(0.0218495856605 0.0126287300227 0.003)
	(0.0374855715851 0.0206508529685 0.003)
	(0.0554855715851 0.0254129717808 0.003)
	(0.0554855715851 0.0135772041091 0.003)
	(0.0554855715851 0.0109470335154 0.003)
	(0.0554855715851 -0.000888734156231 0.003)
	(0.0374855715851 -0.00565085296852 0.003)
	(0.0218495856605 -0.0136729759143 0.003)
	(-0.00649519052838 -0.0279180769833 0.003)
);

edges
(
	arc 0 5 (0.0115048094716 -0.0075 0.0)
	arc 16 21 (0.0115048094716 -0.0075 0.003)
	spline 0 1 (
		(0.0114775856286 -0.00722430607266 0.0)
		(0.0115067433744 -0.00713918325297 0.0)
		(0.0115809087146 -0.00698837518463 0.0)
		(0.0118121868329 -0.00664808401187 0.0)
		(0.0122889304064 -0.00604132921284 0.0)
		(0.012804838624 -0.00546208384175 0.0)
		(0.0133394819662 -0.00490513470447 0.0)
		(0.0144506483093 -0.0038422787858 0.0)
		(0.0156044696932 -0.0028332387537 0.0)
		(0.0167938050524 -0.00187132128836 0.0)
		(0.0180149727021 -0.00095395491958 0.0)
		(0.0192651415205 -7.94056051721e-05 0.0)
		(0.0205430470672 0.000751889417584 0.0)
	)
	spline 1 2 (
		(0.0218495856605 0.00153591866559 0.0)
		(0.0231854326053 0.00226856726842 0.0)
		(0.024551037445 0.00294562519371 0.0)
		(0.0259406623471 0.00357389845371 0.0)
		(0.0273431089819 0.0041719416367 0.0)
		(0.0287539756428 0.00474765921799 0.0)
		(0.0301732472468 0.00530107732235 0.0)
		(0.0316009173943 0.00583220703387 0.0)
		(0.033036988458 0.00634104424319 0.0)
		(0.0344814717041 0.00682756943647 0.0)
		(0.0359343874494 0.00729174742418 0.0)
		(0.0368101526238 0.0075596186661 0.0)
		(0.0370367678076 0.00762361844054 0.0)
		(0.037241908753 0.00763335993226 0.0)
	)
	spline 5 4 (
		(0.0117682984223 -0.00758491709795 0.0)
		(0.0118573641217 -0.00757480893124 0.0)
		(0.0120198273427 -0.00753546969013 0.0)
		(0.0124001684643 -0.00738711646118 0.0)
		(0.0130942242849 -0.00706975529641 0.0)
		(0.0137741250977 -0.00672020266438 0.0)
		(0.0144412917841 -0.00635874783221 0.0)
		(0.0157516764474 -0.00561585312699 0.0)
		(0.0170432057732 -0.00486036483064 0.0)
		(0.0183229071979 -0.00409877945153 0.0)
		(0.0195943669632 -0.0033335031473 0.0)
		(0.0208603385766 -0.0025661355286 0.0)
		(0.0221220264059 -0.00179613530917 0.0)
	)
	spline 4 3 (
		(0.0233784913802 -0.00101941695621 0.0)
		(0.0246290326053 -0.000231821277387 0.0)
		(0.0258731920184 0.000570876515675 0.0)
		(0.0271167159714 0.0013818556547 0.0)
		(0.0283708283833 0.00218251722952 0.0)
		(0.0296399737133 0.00296488271513 0.0)
		(0.0309242271171 0.00372882193777 0.0)
		(0.0322236726083 0.00447418938178 0.0)
		(0.0335384032577 0.00520082384403 0.0)
		(0.0348685214279 0.00590854802686 0.0)
		(0.0362141390463 0.00659716806656 0.0)
		(0.0370290433797 0.00700097133821 0.0)
		(0.0372377691892 0.00710693884483 0.0)
		(0.0373949070009 0.00723771213922 0.0)
	)
	spline 6 7 (
		(0.00767719756604 0.00313199597675 0.0)
		(0.0116229420255 0.00574624138321 0.0)
		(0.011682053748 0.00579385687641 0.0)
		(0.0118003680286 0.00588893053113 0.0)
		(0.0121061776486 0.00613325273199 0.0)
		(0.0126915773457 0.00659531071389 0.0)
		(0.0132894818609 0.00705970971545 0.0)
		(0.0138903868752 0.00751891170018 0.0)
		(0.0151011623783 0.00842178701212 0.0)
		(0.0163238377332 0.00930405117634 0.0)
		(0.0175583561252 0.0101658025986 0.0)
		(0.0188046698326 0.0110071239351 0.0)
		(0.0200627400485 0.0118280824016 0.0)
		(0.0213325367366 0.0126287300227 0.0)
	)
	spline 15 14 (
		(0.00767719756604 -0.0231697099603 0.0)
		(0.0116229420255 -0.0205554645538 0.0)
		(0.011682053748 -0.0205078490606 0.0)
		(0.0118003680286 -0.0204127754059 0.0)
		(0.0121061776486 -0.020168453205 0.0)
		(0.0126915773457 -0.0197063952231 0.0)
		(0.0132894818609 -0.0192419962216 0.0)
		(0.0138903868752 -0.0187827942369 0.0)
		(0.0151011623783 -0.0178799189249 0.0)
		(0.0163238377332 -0.0169976547607 0.0)
		(0.0175583561252 -0.0161359033385 0.0)
		(0.0188046698326 -0.015294582002 0.0)
		(0.0200627400485 -0.0144736235354 0.0)
		(0.0213325367366 -0.0136729759143 0.0)
	)
	spline 15 14 (
		(0.0116229420255 -0.0205554645538 0.0)
		(0.011682053748 -0.0205078490606 0.0)
		(0.0118003680286 -0.0204127754059 0.0)
		(0.0121061776486 -0.020168453205 0.0)
		(0.0126915773457 -0.0197063952231 0.0)
		(0.0132894818609 -0.0192419962216 0.0)
		(0.0138903868752 -0.0187827942369 0.0)
		(0.0151011623783 -0.0178799189249 0.0)
		(0.0163238377332 -0.0169976547607 0.0)
		(0.0175583561252 -0.0161359033385 0.0)
		(0.0188046698326 -0.015294582002 0.0)
		(0.0200627400485 -0.0144736235354 0.0)
		(0.0213325367366 -0.0136729759143 0.0)
	)
	spline 7 8 (
		(0.0226140385203 0.0134091038232 0.0)
		(0.0239072326053 0.014169225964 0.0)
		(0.0252121147317 0.0149091038232 0.0)
		(0.0265286891593 0.0156287300227 0.0)
		(0.0278569686826 0.0163280824016 0.0)
		(0.029196974678 0.0170071239351 0.0)
		(0.0305487371819 0.0176658025986 0.0)
		(0.0319122950013 0.0183040511763 0.0)
		(0.0332876958578 0.0189217870121 0.0)
		(0.034674996566 0.0195189117002 0.0)
		(0.0360742632478 0.0200953107139 0.0)
		(0.0369195980018 0.0204311479707 0.0)
		(0.0371372684984 0.0205161316112 0.0)
		(0.037318407877 0.0205863890043 0.0)
	)
	spline 14 13 (
		(0.0226140385203 -0.0128926021138 0.0)
		(0.0239072326053 -0.012132479973 0.0)
		(0.0252121147317 -0.0113926021138 0.0)
		(0.0265286891593 -0.0106729759143 0.0)
		(0.0278569686826 -0.0099736235354 0.0)
		(0.029196974678 -0.00929458200195 0.0)
		(0.0305487371819 -0.00863590333846 0.0)
		(0.0319122950013 -0.00799765476069 0.0)
		(0.0332876958578 -0.00737991892491 0.0)
		(0.034674996566 -0.00678279423685 0.0)
		(0.0360742632478 -0.00620639522314 0.0)
		(0.0369195980018 -0.00587055796636 0.0)
		(0.0371372684984 -0.00578557432583 0.0)
		(0.037318407877 -0.00571531693278 0.0)
	)
	spline 16 17 (
		(0.0114775856286 -0.00722430607266 0.003)
		(0.0115067433744 -0.00713918325297 0.003)
		(0.0115809087146 -0.00698837518463 0.003)
		(0.0118121868329 -0.00664808401187 0.003)
		(0.0122889304064 -0.00604132921284 0.003)
		(0.012804838624 -0.00546208384175 0.003)
		(0.0133394819662 -0.00490513470447 0.003)
		(0.0144506483093 -0.0038422787858 0.003)
		(0.0156044696932 -0.0028332387537 0.003)
		(0.0167938050524 -0.00187132128836 0.003)
		(0.0180149727021 -0.00095395491958 0.003)
		(0.0192651415205 -7.94056051721e-05 0.003)
		(0.0205430470672 0.000751889417584 0.003)
	)
	spline 17 18 (
		(0.0218495856605 0.00153591866559 0.003)
		(0.0231854326053 0.00226856726842 0.003)
		(0.024551037445 0.00294562519371 0.003)
		(0.0259406623471 0.00357389845371 0.003)
		(0.0273431089819 0.0041719416367 0.003)
		(0.0287539756428 0.00474765921799 0.003)
		(0.0301732472468 0.00530107732235 0.003)
		(0.0316009173943 0.00583220703387 0.003)
		(0.033036988458 0.00634104424319 0.003)
		(0.0344814717041 0.00682756943647 0.003)
		(0.0359343874494 0.00729174742418 0.003)
		(0.0368101526238 0.0075596186661 0.003)
		(0.0370367678076 0.00762361844054 0.003)
		(0.037241908753 0.00763335993226 0.003)
	)
	spline 21 20 (
		(0.0117682984223 -0.00758491709795 0.003)
		(0.0118573641217 -0.00757480893124 0.003)
		(0.0120198273427 -0.00753546969013 0.003)
		(0.0124001684643 -0.00738711646118 0.003)
		(0.0130942242849 -0.00706975529641 0.003)
		(0.0137741250977 -0.00672020266438 0.003)
		(0.0144412917841 -0.00635874783221 0.003)
		(0.0157516764474 -0.00561585312699 0.003)
		(0.0170432057732 -0.00486036483064 0.003)
		(0.0183229071979 -0.00409877945153 0.003)
		(0.0195943669632 -0.0033335031473 0.003)
		(0.0208603385766 -0.0025661355286 0.003)
		(0.0221220264059 -0.00179613530917 0.003)
	)
	spline 20 19 (
		(0.0233784913802 -0.00101941695621 0.003)
		(0.0246290326053 -0.000231821277387 0.003)
		(0.0258731920184 0.000570876515675 0.003)
		(0.0271167159714 0.0013818556547 0.003)
		(0.0283708283833 0.00218251722952 0.003)
		(0.0296399737133 0.00296488271513 0.003)
		(0.0309242271171 0.00372882193777 0.003)
		(0.0322236726083 0.00447418938178 0.003)
		(0.0335384032577 0.00520082384403 0.003)
		(0.0348685214279 0.00590854802686 0.003)
		(0.0362141390463 0.00659716806656 0.003)
		(0.0370290433797 0.00700097133821 0.003)
		(0.0372377691892 0.00710693884483 0.003)
		(0.0373949070009 0.00723771213922 0.003)
	)
	spline 22 23 (
		(0.00767719756604 0.00313199597675 0.003)
		(0.0116229420255 0.00574624138321 0.003)
		(0.011682053748 0.00579385687641 0.003)
		(0.0118003680286 0.00588893053113 0.003)
		(0.0121061776486 0.00613325273199 0.003)
		(0.0126915773457 0.00659531071389 0.003)
		(0.0132894818609 0.00705970971545 0.003)
		(0.0138903868752 0.00751891170018 0.003)
		(0.0151011623783 0.00842178701212 0.003)
		(0.0163238377332 0.00930405117634 0.003)
		(0.0175583561252 0.0101658025986 0.003)
		(0.0188046698326 0.0110071239351 0.003)
		(0.0200627400485 0.0118280824016 0.003)
		(0.0213325367366 0.0126287300227 0.003)
	)
	spline 31 30 (
		(0.00767719756604 -0.0231697099603 0.003)
		(0.0116229420255 -0.0205554645538 0.003)
		(0.011682053748 -0.0205078490606 0.003)
		(0.0118003680286 -0.0204127754059 0.003)
		(0.0121061776486 -0.020168453205 0.003)
		(0.0126915773457 -0.0197063952231 0.003)
		(0.0132894818609 -0.0192419962216 0.003)
		(0.0138903868752 -0.0187827942369 0.003)
		(0.0151011623783 -0.0178799189249 0.003)
		(0.0163238377332 -0.0169976547607 0.003)
		(0.0175583561252 -0.0161359033385 0.003)
		(0.0188046698326 -0.015294582002 0.003)
		(0.0200627400485 -0.0144736235354 0.003)
		(0.0213325367366 -0.0136729759143 0.003)
	)
	spline 31 30 (
		(0.0116229420255 -0.0205554645538 0.003)
		(0.011682053748 -0.0205078490606 0.003)
		(0.0118003680286 -0.0204127754059 0.003)
		(0.0121061776486 -0.020168453205 0.003)
		(0.0126915773457 -0.0197063952231 0.003)
		(0.0132894818609 -0.0192419962216 0.003)
		(0.0138903868752 -0.0187827942369 0.003)
		(0.0151011623783 -0.0178799189249 0.003)
		(0.0163238377332 -0.0169976547607 0.003)
		(0.0175583561252 -0.0161359033385 0.003)
		(0.0188046698326 -0.015294582002 0.003)
		(0.0200627400485 -0.0144736235354 0.003)
		(0.0213325367366 -0.0136729759143 0.003)
	)
	spline 23 24 (
		(0.0226140385203 0.0134091038232 0.003)
		(0.0239072326053 0.014169225964 0.003)
		(0.0252121147317 0.0149091038232 0.003)
		(0.0265286891593 0.0156287300227 0.003)
		(0.0278569686826 0.0163280824016 0.003)
		(0.029196974678 0.0170071239351 0.003)
		(0.0305487371819 0.0176658025986 0.003)
		(0.0319122950013 0.0183040511763 0.003)
		(0.0332876958578 0.0189217870121 0.003)
		(0.034674996566 0.0195189117002 0.003)
		(0.0360742632478 0.0200953107139 0.003)
		(0.0369195980018 0.0204311479707 0.003)
		(0.0371372684984 0.0205161316112 0.003)
		(0.037318407877 0.0205863890043 0.003)
	)
	spline 30 29 (
		(0.0226140385203 -0.0128926021138 0.003)
		(0.0239072326053 -0.012132479973 0.003)
		(0.0252121147317 -0.0113926021138 0.003)
		(0.0265286891593 -0.0106729759143 0.003)
		(0.0278569686826 -0.0099736235354 0.003)
		(0.029196974678 -0.00929458200195 0.003)
		(0.0305487371819 -0.00863590333846 0.003)
		(0.0319122950013 -0.00799765476069 0.003)
		(0.0332876958578 -0.00737991892491 0.003)
		(0.034674996566 -0.00678279423685 0.003)
		(0.0360742632478 -0.00620639522314 0.003)
		(0.0369195980018 -0.00587055796636 0.003)
		(0.0371372684984 -0.00578557432583 0.003)
		(0.037318407877 -0.00571531693278 0.003)
	)
);

blocks
(
	hex ( 0  6  15  5  16  22  31  21 )
	(60 50 1)
	simpleGrading (100 1 1)
	hex ( 1  7  6  0  17  23  22  16 )
	(60 50 1)
	simpleGrading (100  0.1 1)
	hex ( 2  8  7  1  18  24  23  17 )
	(60 50 1)
	simpleGrading (100 10 1)
	hex ( 10  9  8  2  26  25  24  18 )
	(60 80 1)
	simpleGrading (100 0.1 1)
	hex ( 3  11  10  2  19  27  26  18 )
	(80 50 1)
	simpleGrading (10 1 1)
	hex ( 3  13  12  11  19  29  28  27 )
	(60 80 1)
	simpleGrading (100 10 1)
	hex ( 4  14  13  3  20  30  29  19 )
	(60 50 1)
	simpleGrading (100 0.1 1)
	hex ( 5  15  14  4  21  31  30  20 )
	(60 50 1)
	simpleGrading (100 10 1)
);

boundary
(

	blade
	{
		type wall;
		faces
		(
			(0 16 21 5)
			(1 17 16 0)
			(2 18 17 1)
			(3 19 18 2)
			(4 20 19 3)
			(5 21 20 4)

		);
	}

	inlet
	{
		type inlet;
		faces
		(
			(22 6 15 31)

		);
	}

	r_periodic
	{
		type patch;
		
		faces
		(
			(23 7 6 22)
			(24 8 7 23)
			(25 9 8 24)

		);
	}

	l_periodic
	{
		type patch;
		faces
		(
			(30 14 15 31)
			(29 13 14 30)
			(28 12 13 29)

		);
	}

	casing	
	{

	type empty;

		faces
		(

		);
	}

	outlet
	{
		type outlet;
		faces
		(
			(26 10 9 25)
			(27 11 10 26)
			(28 12 11 27)

		);
	}

	hub
	{

	type empty;

		faces
		(
			(0 5 15 6)
			(1 0 6 7)
			(2 1 7 8)
			(10 2 8 9)
			(3 11 10 2)
			(3 11 12 13)
			(4 3 13 14)
			(5 4 14 15)
			(22 31 21 16)
			(23 22 16 17)
			(24 23 17 18)
			(25 24 18 26)
			(27 26 18 19)
			(29 28 27 19)
			(30 29 19 20)
			(31 30 20 21)

		);
	}
);
