cascade_test/0/U
FoamFile
{
 version 2.0;
 format ascii;
 class volVectorField;
 object U;
}

dimensions [ 0 1 -1 0 0 0 0 ];

internalField uniform (0 0 0);

boundaryField
{
  inlet
  {
    type fixedValue;
    value uniform (33.0 50.0 0);
  }
  outlet
  {
    type inletOutlet;
    inletValue uniform (0 0 0);
    //value uniform (0 0 0);
  }
  blade
  {
    type fixedValue;
    value uniform (0 0 0);
  }
  hub
  {
    type empty;
  }

  left_periodic
  {
    type cyclic;
  }
  right_periodic
  {
    type cyclic;
  }
}

